using func;

// 3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда 
// 5 -> Пятница

// -------------------------------------------------------------------

string[] week = new string[] {"Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"};

int day = 0;
bool res = false;
while (res != true) {
	day = rw.getInt("Введите номер дня недели") - 1;
	if (day < 0 || day > 6) rw.echo("-- Попробуйте снова --");
	else res = true;
}

rw.echo($"{week[day]}");

// -------------------------------------------------------------------