using func;

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// -------------------------------------------------------------------

int count = 3;

int[] num = new int[count];
for (int i = 1; i <= count; i++) {
	num[i - 1] = rw.getInt($"Введите {i} число");
}

int max = 0;
foreach (int number in num) {
	if (number > max) max = number;
}

rw.echo($"Максимальное число: {max}");

// -------------------------------------------------------------------