using func;

// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

// -------------------------------------------------------------------

int min = rw.getInt("Введите минимум", true),
	max = rw.getInt("Введите максимум", true),
	sum = 0;

for (int i = min; i <= max; i++) sum += i;

rw.echo($"Сумма нат. эл. в промежутке от {min} до {max} = {sum}");

// -------------------------------------------------------------------