using func;

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

// -------------------------------------------------------------------

int num = rw.getInt("Введите число", true);
if (num % 2 != 0) --num;

string result = "";
for (int i = 2; i <= num; i += 2) {
	if (i != 2) rw.echo(", ", false);
	rw.echo($"{i}", false);
}

rw.echo(result);

// -------------------------------------------------------------------