using func;

// Задача 30: Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
// [1,0,1,1,0,1,0,0]

// -------------------------------------------------------------------

Random rand = new Random();

int count = rw.getInt("Введите кол-во элементов");

int[] arr = new int[count];
for (int i = 0; i < count; i++) arr[i] = rand.Next(0, 2);

rw.echo(string.Join(", ", arr));

// -------------------------------------------------------------------